WcfHarness/WcfHarness/RequestXmls/UpdatePermission.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <UpdatePermission xmlns="http://www.tavisca.com/Vexiere/IPermission/2013/01">
      <updatePermissionRequest i:type="a:UpdateOrganizationPermissionRQ" xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:Permission i:type="a:ActionPermission">
          <a:CreatedOn>0001-01-01T00:00:00</a:CreatedOn>
          <a:Id>0</a:Id>
          <a:ModifiedOn>0001-01-01T00:00:00</a:ModifiedOn>
          <a:Status>Active</a:Status>
          <a:Description>test permission</a:Description>
          <a:IsDeleted>false</a:IsDeleted>
          <a:MethodType>put</a:MethodType>
          <a:Name>trial Permission</a:Name>
          <a:Url i:nil="true"/>
        </a:Permission>
        <a:OrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OrganizationIdentifier>
      </updatePermissionRequest>
    </UpdatePermission>
  </s:Body>
</s:Envelope>